Autodesk.Revit.DB.Structure.AnalyticalMember.GetTrf(System.Double)
The parameter value along a curve that should be in the range [0.0, 1.0], where 0.0 represents start and 1.0 represents end of the element.
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalMember.SetCurveEnd(Autodesk.Revit.DB.XYZ,System.Int32)
Sets curve end point.
point:
the new end for the curve.
end:
Specifies which end: 0 means start, 1 means end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
end is not a valid value (must be 0 (start), 1 (end)).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalMember.GetCurve
Remarks:
Returns curve of analytical member.
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalMember.SetCurve(Autodesk.Revit.DB.Curve)
Sets analytical curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalMember.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve)
Creates a new instance of an analytical member within the project.
aDoc:
A Revit document.
curve:
Curve of the analytical member.
Returns:
The newly created AnalyticalMember instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalMember
An element that represents an analytical member in the structural analytical model.
Since:
2021